guides/cursor/baselines/gin_pprof_runs/k6_gin_20260618_011233.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:12:38+05:30" level=info msg="pprof load: 48 VUs × 35s, scenario=retail_only_signed" source=console

running (0m01.0s), 48/48 VUs, 7165 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.0s), 48/48 VUs, 14327 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 21685 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 28474 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 35619 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 43080 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 50352 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 57836 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 65211 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 72222 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 79506 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 87094 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 94669 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 101889 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 109393 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 116671 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 124221 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 131774 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 139288 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 146892 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 154347 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 161819 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 169277 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 176562 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 184070 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 191888 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 199622 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 207417 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 215184 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 222913 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 230709 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 238578 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 246494 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 254252 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 262061 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s
time="2026-06-18T01:13:13+05:30" level=info msg="pprof load done (started 2026-06-17T19:42:38.381Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<5000' p(99)=16.08ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    http_reqs
    ✓ 'rate>1500' rate=7489.134113/s


  █ TOTAL RESULTS 

    checks_total.......: 524352  14978.211095/s
    checks_succeeded...: 100.00% 524352 out of 524352
    checks_failed......: 0.00%   0 out of 524352

    ✓ status is 200
    ✓ response has content

    CUSTOM
    errors.........................: 0.00%  0 out of 262176
    pdf_generation_time............: avg=4.817848 min=0        med=4      max=49      p(90)=10      p(95)=12      p(99)=17     
    retail_latency.................: avg=4.817848 min=0        med=4      max=49      p(90)=10      p(95)=12      p(99)=17     

    HTTP
    http_req_duration..............: avg=4.27ms   min=316.16µs med=3.2ms  max=46.51ms p(90)=8.79ms  p(95)=10.93ms p(99)=16.08ms
      { expected_response:true }...: avg=4.27ms   min=316.16µs med=3.2ms  max=46.51ms p(90)=8.79ms  p(95)=10.93ms p(99)=16.08ms
    http_req_failed................: 0.00%  0 out of 262177
    http_reqs......................: 262177 7489.134113/s

    EXECUTION
    iteration_duration.............: avg=6.38ms   min=1.35ms   med=5.29ms max=49.52ms p(90)=11.94ms p(95)=14.5ms  p(99)=20.6ms 
    iterations.....................: 262176 7489.105547/s
    vus............................: 48     min=48          max=48
    vus_max........................: 48     min=48          max=48

    NETWORK
    data_received..................: 14 GB  412 MB/s
    data_sent......................: 2.0 GB 57 MB/s



running (0m35.0s), 00/48 VUs, 262176 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s